<?xml version="1.0" ?>
<net name="retinanet-tf" version="10">
	<layers>
		<layer id="0" name="anchors_0/Reshape_2/Output_0/Data__const" type="Const" version="opset1">
			<data offset="0" size="72" shape="1,9,4" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="anchors_0/Reshape_2:0">
					<dim>1</dim>
					<dim>9</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="anchors_0/arange/start/Output_0/Data__const" type="Const" version="opset1">
			<data offset="72" size="4" shape="" element_type="i32"/>
			<output>
				<port id="0" precision="I32" names="anchors_0/arange/start:0"/>
			</output>
		</layer>
		<layer id="2" name="input_1" type="Parameter" version="opset1">
			<data shape="1,3,1333,1333" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input_1:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1333</dim>
					<dim>1333</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="input_1/mean_input_port_1/value10474_const" type="Const" version="opset1">
			<data offset="76" size="6" shape="1,3,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="input_1/mean" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1333</dim>
					<dim>1333</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1333</dim>
					<dim>1333</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1/convolution/Transpose39595_const" type="Const" version="opset1">
			<data offset="82" size="18816" shape="64,3,7,7" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="conv1/kernel/read:0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1/convolution" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="3,3" pads_end="3,3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1333</dim>
					<dim>1333</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>667</dim>
					<dim>667</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_2952730485/EltwiseUnsqueeze30929_const" type="Const" version="opset1">
			<data offset="18898" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="bn_conv1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>667</dim>
					<dim>667</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn_conv1/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>667</dim>
					<dim>667</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>667</dim>
					<dim>667</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="conv1_relu/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>667</dim>
					<dim>667</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="pool1/MaxPool" type="MaxPool" version="opset1">
			<data strides="2,2" kernel="3,3" pads_begin="1,1" pads_end="1,1" auto_pad="same_upper"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>667</dim>
					<dim>667</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="pool1/MaxPool:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="res2a_branch2a/convolution/Transpose39599_const" type="Const" version="opset1">
			<data offset="19026" size="8192" shape="64,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2a_branch2a/kernel/read:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="res2a_branch2a/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_295382954330489/EltwiseUnsqueeze30945_const" type="Const" version="opset1">
			<data offset="27218" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="bn2a_branch2a/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2a_branch2a/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="res2a_branch2a_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2a_branch2a_relu/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="res2a_branch2b/convolution/Transpose39603_const" type="Const" version="opset1">
			<data offset="27346" size="73728" shape="64,64,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2a_branch2b/kernel/read:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="res2a_branch2b/convolution" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_295462955130491/EltwiseUnsqueeze30953_const" type="Const" version="opset1">
			<data offset="101074" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="bn2a_branch2b/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2a_branch2b/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="res2a_branch2b_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2a_branch2b_relu/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="res2a_branch2c/convolution/Transpose39607_const" type="Const" version="opset1">
			<data offset="101202" size="32768" shape="256,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2a_branch2c/kernel/read:0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="res2a_branch2c/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="data_add_295542955930493/EltwiseUnsqueeze30961_const" type="Const" version="opset1">
			<data offset="133970" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="bn2a_branch2c/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2a_branch2c/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="res2a_branch1/convolution/Transpose39611_const" type="Const" version="opset1">
			<data offset="134482" size="32768" shape="256,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2a_branch1/kernel/read:0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="res2a_branch1/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_295302953530487/EltwiseUnsqueeze30937_const" type="Const" version="opset1">
			<data offset="167250" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="bn2a_branch1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2a_branch1/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="res2a/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="res2a/add:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="res2a_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2a_relu/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="res2b_branch2a/convolution/Transpose39615_const" type="Const" version="opset1">
			<data offset="167762" size="32768" shape="64,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2b_branch2a/kernel/read:0">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="res2b_branch2a/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_295622956730495/EltwiseUnsqueeze30969_const" type="Const" version="opset1">
			<data offset="200530" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="bn2b_branch2a/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2b_branch2a/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="res2b_branch2a_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2b_branch2a_relu/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="res2b_branch2b/convolution/Transpose39619_const" type="Const" version="opset1">
			<data offset="200658" size="73728" shape="64,64,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2b_branch2b/kernel/read:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="res2b_branch2b/convolution" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_295702957530497/EltwiseUnsqueeze30977_const" type="Const" version="opset1">
			<data offset="274386" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="bn2b_branch2b/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2b_branch2b/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="res2b_branch2b_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2b_branch2b_relu/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="res2b_branch2c/convolution/Transpose39623_const" type="Const" version="opset1">
			<data offset="274514" size="32768" shape="256,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2b_branch2c/kernel/read:0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="res2b_branch2c/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_295782958330499/EltwiseUnsqueeze30985_const" type="Const" version="opset1">
			<data offset="307282" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="bn2b_branch2c/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2b_branch2c/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="res2b/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="res2b/add:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="res2b_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2b_relu/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="res2c_branch2a/convolution/Transpose39627_const" type="Const" version="opset1">
			<data offset="307794" size="32768" shape="64,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2c_branch2a/kernel/read:0">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="res2c_branch2a/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_295862959130501/EltwiseUnsqueeze30993_const" type="Const" version="opset1">
			<data offset="340562" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="bn2c_branch2a/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2c_branch2a/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="res2c_branch2a_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2c_branch2a_relu/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="res2c_branch2b/convolution/Transpose39631_const" type="Const" version="opset1">
			<data offset="340690" size="73728" shape="64,64,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2c_branch2b/kernel/read:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="res2c_branch2b/convolution" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_295942959930503/EltwiseUnsqueeze31001_const" type="Const" version="opset1">
			<data offset="414418" size="128" shape="1,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="bn2c_branch2b/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2c_branch2b/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="res2c_branch2b_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2c_branch2b_relu/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="res2c_branch2c/convolution/Transpose39635_const" type="Const" version="opset1">
			<data offset="414546" size="32768" shape="256,64,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res2c_branch2c/kernel/read:0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="res2c_branch2c/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_296022960730505/EltwiseUnsqueeze31009_const" type="Const" version="opset1">
			<data offset="447314" size="512" shape="1,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="bn2c_branch2c/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn2c_branch2c/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="res2c/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="res2c/add:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="res2c_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res2c_relu/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="res3a_branch2a/convolution/Transpose39639_const" type="Const" version="opset1">
			<data offset="447826" size="65536" shape="128,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3a_branch2a/kernel/read:0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="res3a_branch2a/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_296182962330509/EltwiseUnsqueeze31025_const" type="Const" version="opset1">
			<data offset="513362" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="bn3a_branch2a/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3a_branch2a/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="res3a_branch2a_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res3a_branch2a_relu/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="res3a_branch2b/convolution/Transpose39643_const" type="Const" version="opset1">
			<data offset="513618" size="294912" shape="128,128,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3a_branch2b/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="res3a_branch2b/convolution" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="data_add_296262963130511/EltwiseUnsqueeze31033_const" type="Const" version="opset1">
			<data offset="808530" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bn3a_branch2b/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3a_branch2b/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="res3a_branch2b_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res3a_branch2b_relu/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="res3a_branch2c/convolution/Transpose39647_const" type="Const" version="opset1">
			<data offset="808786" size="131072" shape="512,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3a_branch2c/kernel/read:0">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="res3a_branch2c/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_296342963930513/EltwiseUnsqueeze31041_const" type="Const" version="opset1">
			<data offset="939858" size="1024" shape="1,512,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="bn3a_branch2c/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3a_branch2c/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="res3a_branch1/convolution/Transpose39651_const" type="Const" version="opset1">
			<data offset="940882" size="262144" shape="512,256,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3a_branch1/kernel/read:0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="res3a_branch1/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>334</dim>
					<dim>334</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="data_add_296102961530507/EltwiseUnsqueeze31017_const" type="Const" version="opset1">
			<data offset="1203026" size="1024" shape="1,512,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="bn3a_branch1/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3a_branch1/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="res3a/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="res3a/add:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="res3a_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res3a_relu/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="res3b_branch2a/convolution/Transpose39655_const" type="Const" version="opset1">
			<data offset="1204050" size="131072" shape="128,512,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3b_branch2a/kernel/read:0">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="res3b_branch2a/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="data_add_296422964730515/EltwiseUnsqueeze31049_const" type="Const" version="opset1">
			<data offset="1335122" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="bn3b_branch2a/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3b_branch2a/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="res3b_branch2a_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res3b_branch2a_relu/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="res3b_branch2b/convolution/Transpose39659_const" type="Const" version="opset1">
			<data offset="1335378" size="294912" shape="128,128,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3b_branch2b/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="res3b_branch2b/convolution" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="data_add_296502965530517/EltwiseUnsqueeze31057_const" type="Const" version="opset1">
			<data offset="1630290" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="bn3b_branch2b/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3b_branch2b/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="res3b_branch2b_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res3b_branch2b_relu/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="res3b_branch2c/convolution/Transpose39663_const" type="Const" version="opset1">
			<data offset="1630546" size="131072" shape="512,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3b_branch2c/kernel/read:0">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="res3b_branch2c/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="data_add_296582966330519/EltwiseUnsqueeze31065_const" type="Const" version="opset1">
			<data offset="1761618" size="1024" shape="1,512,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="bn3b_branch2c/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3b_branch2c/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="res3b/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="res3b/add:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="res3b_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res3b_relu/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="res3c_branch2a/convolution/Transpose39667_const" type="Const" version="opset1">
			<data offset="1762642" size="131072" shape="128,512,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3c_branch2a/kernel/read:0">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="res3c_branch2a/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="data_add_296662967130521/EltwiseUnsqueeze31073_const" type="Const" version="opset1">
			<data offset="1893714" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="bn3c_branch2a/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3c_branch2a/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="res3c_branch2a_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res3c_branch2a_relu/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="res3c_branch2b/convolution/Transpose39671_const" type="Const" version="opset1">
			<data offset="1893970" size="294912" shape="128,128,3,3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3c_branch2b/kernel/read:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="res3c_branch2b/convolution" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="data_add_296742967930523/EltwiseUnsqueeze31081_const" type="Const" version="opset1">
			<data offset="2188882" size="256" shape="1,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="bn3c_branch2b/FusedBatchNorm/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="bn3c_branch2b/FusedBatchNorm:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="res3c_branch2b_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="res3c_branch2b_relu/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="res3c_branch2c/convolution/Transpose39675_const" type="Const" version="opset1">
			<data offset="2189138" size="131072" shape="512,128,1,1" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="res3c_branch2c/kernel/read:0">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="res3c_branch2c/convolution" type="Convolution" version="opset1">
			<data auto_pad="valid" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>167</dim>
					<dim>167</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
